In [10]:
import psycopg2
import pandas as pd
import numpy as np

In [11]:
conn = psycopg2.connect(
    host="localhost",
    dbname="postgres",
    user="postgres",
    password="postgres"
)

In [12]:
cur = conn.cursor()

In [13]:
cur.execute("""
select 'p' charecter, bank_id, swtc+swtv total, wight
from(
    select bank_id, sum(wight) wight , sum(transaction_value) swtv, sum(transaction_cost) swtc
    from(
        select bank_id, transaction_type_chain, sum(new_count) wight, transaction_cost, transaction_value
        from(
            select *
            from(
                select bank_id, transaction_type_chain,  count(count) new_count, transaction_cost, transaction_value
                from (select transaction_type_chain, dest_wallet_id, bank_id, transaction_cost, transaction_value, transaction_gateway_id, count, transaction_type, wallet_nickname, time_internal from data_dataset) as newdataset
                where count = 0
                group by bank_id, transaction_type_chain, transaction_cost, transaction_value) as b0

        union all
        select *
        from(
            select bank_id, transaction_type_chain,  count new_count, transaction_cost, transaction_value
            from (select transaction_type_chain, dest_wallet_id, bank_id, transaction_cost, transaction_value, transaction_gateway_id, count, transaction_type, wallet_nickname, time_internal from data_dataset) as newdataset
            where count != 0) as b1) as b2
    group by bank_id, transaction_type_chain, transaction_cost, transaction_value) as b3
where transaction_type_chain like '%p%'
group by bank_id) as b4
where bank_id = {{number_of_bank_id}}
union all
select 'c' charecter, bank_id, swtc+swtv total, wight
from(
    select bank_id, sum(wight) wight , sum(transaction_value) swtv, sum(transaction_cost) swtc
    from(
        select bank_id, transaction_type_chain, sum(new_count) wight, transaction_cost, transaction_value
        from(
            select *
            from(
                select bank_id, transaction_type_chain,  count(count) new_count, transaction_cost, transaction_value
                from (select transaction_type_chain, dest_wallet_id, bank_id, transaction_cost, transaction_value, transaction_gateway_id, count, transaction_type, wallet_nickname, time_internal from data_dataset) as newdataset
                where count = 0
                group by bank_id, transaction_type_chain, transaction_cost, transaction_value) as b0
 
        union all
        select *
        from(
            select bank_id, transaction_type_chain,  count new_count, transaction_cost, transaction_value
            from (select transaction_type_chain, dest_wallet_id, bank_id, transaction_cost, transaction_value, transaction_gateway_id, count, transaction_type, wallet_nickname, time_internal from data_dataset) as newdataset
            where count != 0) as b1) as b2
    group by bank_id, transaction_type_chain, transaction_cost, transaction_value) as b3
where transaction_type_chain like '%c%'
group by bank_id) as b4
where bank_id = {{number_of_bank_id}}
union all
select 's' charecter, bank_id, swtc+swtv total, wight
from(
    select bank_id, sum(wight) wight , sum(transaction_value) swtv, sum(transaction_cost) swtc
    from(
        select bank_id, transaction_type_chain, sum(new_count) wight, transaction_cost, transaction_value
        from(
            select *
            from(
                select bank_id, transaction_type_chain,  count(count) new_count, transaction_cost, transaction_value
                from (select transaction_type_chain, dest_wallet_id, bank_id, transaction_cost, transaction_value, transaction_gateway_id, count, transaction_type, wallet_nickname, time_internal from data_dataset) as newdataset
                where count = 0
                group by bank_id, transaction_type_chain, transaction_cost, transaction_value) as b0
 
        union all
        select *
        from(
            select bank_id, transaction_type_chain,  count new_count, transaction_cost, transaction_value
            from (select transaction_type_chain, dest_wallet_id, bank_id, transaction_cost, transaction_value, transaction_gateway_id, count, transaction_type, wallet_nickname, time_internal from data_dataset) as newdataset
            where count != 0) as b1) as b2
    group by bank_id, transaction_type_chain, transaction_cost, transaction_value) as b3
where transaction_type_chain like '%s%'
group by bank_id) as b4
where bank_id = {{number_of_bank_id}}
union all
select 'm' charecter, bank_id, swtc+swtv total, wight
from(
    select bank_id, sum(wight) wight , sum(transaction_value) swtv, sum(transaction_cost) swtc
    from(
        select bank_id, transaction_type_chain, sum(new_count) wight, transaction_cost, transaction_value
        from(
            select *
            from(
                select bank_id, transaction_type_chain,  count(count) new_count, transaction_cost, transaction_value
                from (select transaction_type_chain, dest_wallet_id, bank_id, transaction_cost, transaction_value, transaction_gateway_id, count, transaction_type, wallet_nickname, time_internal from data_dataset) as newdataset
                where count = 0
                group by bank_id, transaction_type_chain, transaction_cost, transaction_value) as b0
 
        union all
        select *
        from(
            select bank_id, transaction_type_chain,  count new_count, transaction_cost, transaction_value
            from (select transaction_type_chain, dest_wallet_id, bank_id, transaction_cost, transaction_value, transaction_gateway_id, count, transaction_type, wallet_nickname, time_internal from data_dataset) as newdataset
            where count != 0) as b1) as b2
    group by bank_id, transaction_type_chain, transaction_cost, transaction_value) as b3
where transaction_type_chain like '%m%'
group by bank_id) as b4
where bank_id = 13335
order by total desc """)

SyntaxError: syntax error at or near "{"
LINE 24: where bank_id = {{number_of_bank_id}}
                         ^

In [14]:
result = cur.fetchall()
pd.DataFrame(result)

ProgrammingError: no results to fetch

In [13]:
data = pd.read_csv('../../github_source/tranasaction_dataset.csv', parse_dates=['time_internal'])
data = data.replace(np.nan,0)

In [14]:
tmp_data = data[data['count'] == 0]
tmp_data
dg1 = tmp_data.groupby(by=['bank_id', 'transaction_type_chain', 'transaction_cost', 'transaction_value']).agg({'count': 'count'}).reset_index()

In [15]:
tmp_data2 = data[data['count'] != 0]
dg2 = tmp_data2[['count', 'bank_id', 'transaction_type_chain', 'transaction_cost', 'transaction_value']]

In [16]:
dg = pd.concat([dg1, dg2])
dg_total = []
dg_total.append(dg[dg['transaction_type_chain'].str.contains('c')])
dg_total.append(dg[dg['transaction_type_chain'].str.contains('m')])
dg_total.append(dg[dg['transaction_type_chain'].str.contains('p')])
dg_total.append(dg[dg['transaction_type_chain'].str.contains('s')])

In [17]:
result = []
for i in range(4):
    result.append([])
    
for i in range(4):
    dg_total[i] = dg_total[i].groupby(by=['bank_id', 'transaction_type_chain', 'transaction_cost', 'transaction_value']).agg({'count': 'sum'}).reset_index()
    dg_total[i] = dg_total[i].groupby(by=['bank_id']).agg({
        'count' : 'sum',
        'transaction_cost' : 'sum',
        'transaction_value' : 'sum'
    }).reset_index()
    dg_total[i]['total_value'] = dg_total[i]['transaction_cost'] + dg_total[i]['transaction_value']
    dg_total[i] = dg_total[i].drop(['transaction_cost', 'transaction_value'], axis='columns')
    your_bank_id = 13335
    result[i] = dg_total[i][dg_total[i]['bank_id'] == your_bank_id].sort_values('total_value', ascending=False)
dg = pd.concat([result[0], result[1], result[2], result[3]])
dg.index = ['c', 'm', 'p', 's']
dg

   bank_id    count  total_value
c    13335    10397    858215940
m    13335  1140958  87530414114
p    13335  1219889  87532276892
s    13335  1219891  87544747219